{
  "data": [
    {
      "title": "Communo",
      "subTitle": "JavaScript, React, TypeScript, Ionic, Capacitor, Tailwind, Twilio, HTML, CSS, Github",
      "url": "https://www.communo.com",
      "text": "<p>I had the great opportunity to work with the talented product team at Communo to help them develop their web SPA and native mobile app using Ionic React with Capacitor. My primary task was to build out the applications chat features which integrated with Twilio's programmable chat API.</p><p>The chat feature was developed in isolation from the rest of the app, including its own state management. This decoupling of the feature made it agile and easy to maintain. Components were developed with flexibility in mind so that they could be dropped into any context with minimial effort. For example, a chat conversation could be dropped in to any page for an instant contextual chat experience.</p>",
      "images": [
        "/images/work/communo-1.jpg",
        "/images/work/communo-2.jpg",
        "/images/work/communo-3.jpg",
        "/images/work/communo-4.jpg"
      ]
    },
    {
      "title": "Casino.eu",
      "subTitle": "JavaScript, Vue, Vuex, Laravel, Webpack, Pusher, GSAP, HTML, SASS, SVG, BitBucket",
      "url": "https://www.casino.eu",
      "text": "<p>Over the past few years, Casino.eu has grown from a rather simple hub for gamers to a full fledged responsive and immersive single-page application powered by a robust custom CMS. Users of the site enjoy their time by discovering new games with fresh offers. And, by using Pusher, we keep them up to date in real time.</p><p>Using modern development techniques such as Webpack's code splitting coupled with ES6 asynchronous imports and lazy loading images assisted by IntersectionObserver, I was able to provide an optimized and efficient experience for both mobile and desktop users. The project itself consists of over 150 different components, directives, and custom Vue plugins.</p>",
      "images": [
        "/images/work/casino-1.jpg",
        "/images/work/casino-2.jpg",
        "/images/work/casino-6.jpg",
        "/images/work/casino-3.jpg",
        "/images/work/casino-4.jpg",
        "/images/work/casino-5.jpg",
        "/images/work/casino-7.jpg",
        "/images/work/casino-8.jpg"
      ]
    },
    {
      "title": "Casino.eu - Portal",
      "subTitle": "JavaScript, Vue, Vuex, Laravel, Webpack, Pusher, GSAP, HTML, SASS, SVG, BitBucket",
      "url": "https://portal.casino.eu",
      "text": "<p>The backbone for Casino.eu, Portal drives content and provides the API required to power the Casino.eu ecosystem. Because of the clients unique requests, we felt it best to develop a custom CMS powered by Vue to help them manage things.</p><p>Because of Vue's simple yet powerful reactive feature set it was the ideal candidate to help us build a responsive SPA for the CMS. To assist Vue, Laravel is used to do the heavy lifting on the backend and Pusher is integrated to provide users with real time updates. As a final touch, GSAP helps bring life to a unique on boarding experience when users sign up to Casino.eu.</p>",
      "images": [
        "/images/work/portal-1.jpg",
        "/images/work/portal-2.jpg",
        "/images/work/portal-3.jpg",
        "/images/work/portal-4.jpg",
        "/images/work/portal-5.jpg",
        "/images/work/portal-6.jpg"
      ]
    },
    {
      "title": "Remax - Perfect Match",
      "subTitle": "JavaScript, Vue, AdonisJS, MySQL, OAuth, HTML, SASS, BitBucket",
      "url": "https://perfectmatch.remax-malta.com/",
      "text": "<p>BRND WGN approached me to take on an interesting microsite concept; a Tinder-eqsue property search tool. The concept was quite simple, a property search wizard followed by a Tinder style like or dislike feature for sorting.<p><p>The frontend, being powered by Vue, nicely integrates with a headless backend API running on Node and powered by AdonisJS coupled with MySQL. Integration with Facebook and Google (as well as email) allows users to create an account to save their liked/disliked properties.</p>",
      "images": [
        "/images/work/remax-1.jpg",
        "/images/work/remax-2.jpg",
        "/images/work/remax-3.jpg",
        "/images/work/remax-4.jpg"
      ]
    },
    {
      "title": "GO Fibre Experience",
      "subTitle": "JavaScript, Vue, Phillips Hue Node API, Socket.io, Express, Webpack, HTML, SASS, BitBucket",
      "url": "",
      "text": "<p>GO (one of Malta's largest telecom providers) came to BRND WGN for help in marketing their fibre network. This became a truly unique project using web technologies to create an immersive experience. Teaming up with the creatives at BRND WGN, I developed a two part web application. The first part was a dashboard interface displayed on a tablet where users were given instructions to interact with. Depending on the stage of the experience video would be either played on the dashboard or on a large mounted flatscreen.</p><p>During the experience coloured lighting would change to go with the videos. This was all powered by a Node.js Express server, WebSockets, and integration with the Phillips HUE api. A custom cueing system was developed to manage the video, audio, and lighting to ensure everything synced up perfectly.</p>",
      "images": [
        "/images/work/go-fibre-1.jpg",
        "/images/work/go-fibre-2.jpg",
        "/images/work/go-fibre-3.jpg",
        "/images/work/go-fibre-4.jpg"
      ]
    },
    {
      "title": "GO Directory App",
      "subTitle": "JavaScript, Ionic, Angular 1, Cordova, Gulp, HTML, SASS, BitBucket",
      "url": "",
      "text": "<p>Whilst working at BRND WGN, GO (one of Malta's largest telecom providers) approached us to develop a directory app that allowed users to search for any publicly accessible number in Malta. GO needed this mobile app to work on both phones and tablets as well as both iOS and Android. Naturally we thought this would be a perfect use case for a hybrid app.</p><p>So, with those requirements in mind, I reached to Ionic to help get the job done. Using Angular and integrating a few extra Cordova plugins to access features such as address books, connectivity, and system dialogs, I was able to efficiently develop and turn around a production ready app within a few short weeks.</p>",
      "images": [
        "/images/work/go-directory-1.jpg",
        "/images/work/go-directory-2.jpg",
        "/images/work/go-directory-3.jpg"
      ]
    },
    {
      "title": "nTrust",
      "subTitle": "JavaScript, jQuery, WebSockets, HTML, SASS, SVN",
      "url": "",
      "text": "<p>I was brought on to nTrust to help take their existing web app to the next level. Originally built solely with jQuery, I guided the front end team towards an improved JavaScript architecture using module patterns that allowed for a robust, reliable, and maintainable code base which consequently improved developer experience.</p><p>nTrust's applications were comprised of two main facets; a customer web app and a merchant web app. With each app our goal was to make transactional tasks such as remittance, deposits, and merchant payments as quick and painless as possible. Using WebSockets we were able to provide a seamless and instantaneous user experience for both customers and merchants.</p>",
      "images": [
        "/images/work/ntrust-1.jpg",
        "/images/work/ntrust-2.jpg",
        "/images/work/ntrust-3.jpg"
      ]
    }
  ]
}
